Repository: StanfordSpezi/SpeziFirebase
Catalog: Sources/SpeziFirebaseAccount/Resources/*.lproj/Localizable.strings
Languages: de

# FIREBASE_EMAIL_AND_PASSWORD
source: E-Mail and Password
de: E-Mail und Password

# FIREBASE_ACCOUNT_DEFAULT_PASSWORD_RULE_ERROR %lld
source: Your password must be at least %lld characters long.
de: Dein Passwort muss mindestens %lld Zeichen lang sein.

# FIREBASE_ACCOUNT_ERROR_INVALID_EMAIL
source: Invalid email address
de: Inkorrekte E-Mail Adresse

# FIREBASE_ACCOUNT_ERROR_INVALID_EMAIL_SUGGESTION
source: Please enter a valid email address.
de: Bitte gebe eine korrekte E-Mail Adresse ein.

# FIREBASE_ACCOUNT_ALREADY_IN_USE
source: Account already exists
de: Benutzerkonto existiert bereits

# FIREBASE_ACCOUNT_ALREADY_IN_USE_SUGGESTION
source: An account with this email already exists. Please login using your email and password.
de: Ein Benutzerkonto mit dieser E-Mail Adresse existiert bereits. Bitte loggen dich mit dem Account ein.

# FIREBASE_ACCOUNT_WEAK_PASSWORD
source: Weak Password
de: Schwaches Passwort

# FIREBASE_ACCOUNT_WEAK_PASSWORD_SUGGESTION
source: Please choose a safer password.
de: Bitte gebe ein stärkeres Password ein.

# FIREBASE_ACCOUNT_INVALID_CREDENTIALS
source: Invalid Credentials
de: Ungültige Zugangsdaten

# FIREBASE_ACCOUNT_INVALID_CREDENTIALS_SUGGESTION
source: Please verify that your email and password are correct.
de: Bitte überprüfe die eingegebene E-Mail Adresse und dein Passwort.

# FIREBASE_ACCOUNT_FAILED_PASSWORD_RESET
source: Failed to reset password
de: Zurücksetzten des Passworts fehlgeschlagen

# FIREBASE_ACCOUNT_FAILED_PASSWORD_RESET_SUGGESTION
source: There was an issue delivering the password reset email. Please try again.
de: Es ist ein Fehler aufgetreten bei dem Versuch Ihr Passwort zurückzusetzen. Bitte versuche es später erneut.

# FIREBASE_ACCOUNT_SETUP_ERROR
source: Could not complete account operation
de: Anfrage fehlgeschlagen

# FIREBASE_ACCOUNT_SETUP_ERROR_SUGGESTION
source: There was an internal error when trying to perform the account operation. Please try again later.
de: Bei der Anfrage für dein Benutzerkonto ist ein Fehler aufgetreten. Bitte versuche es später erneut.

# FIREBASE_ACCOUNT_SIGN_IN_ERROR
source: Not signed in
de: Nicht eingeloggt

# FIREBASE_ACCOUNT_SIGN_IN_ERROR_SUGGESTION
source: Couldn't complete this operation as there is no current user account.
de: Die Anfrage konnte nicht ausgeführt werden weil kein verknüpftes Benutzerkonto gefunden wurde.

# FIREBASE_ACCOUNT_REQUIRE_RECENT_LOGIN_ERROR
source: Couldn't complete operation
de: Anfrage fehlgeschlagen

# FIREBASE_ACCOUNT_REQUIRE_RECENT_LOGIN_ERROR_SUGGESTION
source: This is a security relevant operation that requires a recent login.
de: Diese Anfrage is sicherheitsrelevant und erfordert einen kürzlichen Login.

# FIREBASE_APPLE_FAILED
source: Sign in with Apple failed
de: Mit Apple anmelden ist fehlgeschlagen

# FIREBASE_APPLE_FAILED_SUGGESTION
source: We had issues completing your Sign in with Apple request. Please try again later.
de: Wir hatten Probleme dich mit Apple anzumelden. Bitte versuche es später erneut.

# FIREBASE_ACCOUNT_UNKNOWN
source: Failed account operation
de: Anfrage fehlgeschlagen

# FIREBASE_ACCOUNT_UNKNOWN_SUGGESTION
source: Please check your internet connection and try again.
de: Bitte überprüfen deine Internet Verbindung und versuche es erneut.
